In [ ]:
Section 1
1.1 SELECT AccelSec FROM evCars
1.2 SELECT Accel, TRIM(accel, ' sec')
FROM evCars
1.3 UPDATE evCars SET Accel = TRIM(accel, ' sec');
1.4 ALTER TABLE evCars
	RENAME Accel TO AccelSec

Section 2 
2.0 SELECT TopSpeed, Range, efficiency, FastCharge
FROM evCars 
LIMIT 10
2.1  SELECT TopSpeed 
FROM evCars 
2.2 SELECT TopSpeed, TRIM(topspeed, ' km/h')
FROM evCars 
2.3 103 rows
2.4 UPDATE evCars SET TopSpeed = TRIM(topspeed, ' km/h');
2.5 SELECT TopSpeed 
FROM evCars 
2.6 SELECT TopSpeed, ROUND(topspeed * 0.621371,1)
FROM evCars
UPDATE evCars
SET TopSpeed = ROUND(topspeed * 0.621371,1)
2.7 ALTER TABLE evCars
RENAME TopSpeed TO TopSpeedMPH
2.8 SELECT * 
FROM evCars

SECTION 3 
3.1 SELECT Range 
FROM evCars 
3.2 SELECT Range, TRIM(range, ' km')
FROM evCars 
3.3 UPDATE evCars
SET Range = TRIM(range, ' km');
3.4  UPDATE evCars
SET Range = TRIM(range, ' km');
3.5 SELECT range 
FROM evCars
3.6 SELECT Range, ROUND(range * 0.621371,1)
FROM evCars
 UPDATE evCars 
SET Range = ROUND(range * 0.621371,1)
3.7 ALTER TABLE evCars 
RENAME Range TO RangeMiles
3.8 SELECT RangeMiles 
FROM evCars

SECTION 4 
4.1 SELECT Efficiency, FastCharge 
FROM evCars
4.2 SELECT Efficiency, TRIM(efficiency, ' Wh/km')
FROM evCars 
SELECT Efficiency, FastCharge, TRIM(efficiency, ' Wh/km'),TRIM(fastcharge, ' km/h')
FROM evCars
4.3 SELECT Efficiency, FastCharge 
FROM evCars
4.4 UPDATE evCars 
SET Efficiency = TRIM(efficiency, ' Wh/km'), FastCharge = TRIM(fastcharge, ' km/h')
4.5 SELECT Efficiency, FastCharge 
FROM evCars
4.6 * skipped this step on accident **
SELECT OneHourFastChargeMiles, ROUND(onehourfastchargemiles * 0.621371,1)
FROM evCars 

4.7 ALTER TABLE evCars
RENAME Efficiency to efficiencyWHperKM
ALTER TABLE evCars
RENAME FastCharge to OneHourFastChargeMiles
4.8 SELECT *
FROM evCars

SECTION 5 
5.1 SELECT RapidCharge, Count(*)
from evCars
GROUP BY RapidCharge

5.2 UPDATE evCars 
SET RapidCharge = '3'
WHERE RapidCharge is '5'

5.3 For the purpose of this exercise, if the car's `RapidCharge` value equals 3 then I want you to change the value to 'Yes' 
- If the `RapidCharge` value equals 5 then I want you to change the value to 'No'.

SECTION 6 
6.1 SELECT PowerTrain, Count(*)
FROM evCars 
GROUP BY PowerTrain

6.2 - look at the three DISTINCT values from the query you wrote in 6.1 and fill in the blanks.
- If the PowerTrain equals _____41_________ then I want you to change the value to 'AWD'
- If the PowerTrain equals _______25_____ then I want you to change the value to 'RWD'
- If the PowerTrain equals ______37________ then I want you to change the value to 'FWD

6.3 UPDATE PowerTrain
SET Rear Wheel Drive = '25'
WHERE Count = '22'

UPDATE PowerTrain
SET ALL Wheel Drive = '41'
WHERE Count = '39'

UPDATE PowerTrain
SET Front Wheel Drive = '37'
WHERE Count = '44'

SECTION 7 
7.1 SELECT PriceEuro, ROUND(priceeuro  *1.09,2)
FROM evCars 
7.2 UPDATE evCars
SET PriceEuro=Round(priceeuro *1.09,2)
7.3 ALTER TABLE evCars
RENAME ROUND(priceeuro * 1.09,2) TO PriceUSD